import React from 'react';

const Things = () => {
    return (
        <section className="section">
            <h2 className="projectTitles">Теории</h2>
            <div className="thingsContent">
                <div className="projectItems">
                    <ul>
                        <li><h2 className="thingsTitle">Теория - 1</h2></li>
                        <li><h2 className="thingsTitle">Все неудачи Невилла Долгопупса из-за неправильной волшебной палочки </h2></li>
                        <hr/>
                        <li><p className="projectDesc">Волшебная палочка выбирает хозяина, а не наоборот. Помнишь, как Гарри чуть не разнес магазин Оливандера, прежде чем взял в руки ту самую «11 дюймов, остролист и перо феникса». А Невилл долгое время пользовался неправильной палочкой, которая принадлежала его отцу. Вероятно, поэтому он не преуспевал в заклинаниях – палочка просто отказывалась его слушаться. Он купил новую в магазине Оливандера – и вуаля, стал предводителем «Армии Дамблдора».</p></li>
                    </ul>
                </div>
                <div className="projectItems">
                    <ul>
                        <li><h2 className="thingsTitle">Теория - 2</h2></li>
                        <li><h2 className="thingsTitle">Профессор Трелони не ошиблась в дате рождения Гарри</h2></li>
                        <hr/>
                        <li><p className="projectDesc">На одном из уроков прорицания Трелони сказала Гарри Поттеру: «Думаю, что не ошибусь, если скажу, что вы родились в середине зимы?» «Нет, — ответил Гарри. — Я родился в июле». Да, он действительно родился 31 июля, но и сказать, что Трелони ошиблась, нельзя. Все дело в том, что Гарри – один из крестражей Волан-де-Морта, в нем есть частичка его души. А сам Темный лорд родился 31 декабря – как раз в середине зимы.</p></li>
                    </ul>
                </div>
                <div className="projectItems">
                    <ul>
                        <li><h2 className="thingsTitle">Теория - 3</h2></li>
                        <li><h2 className="thingsTitle">Дурсли издевались над Гарри, потому что были под его влиянием</h2></li>
                        <hr/>
                        <li><p className="projectDesc">Помнишь, как Гарри, Рон и Гермиона носили один из крестражей – Медальон Слизерина – на шее по очереди, иначе становились раздражительными и готовыми растерзать друг друга? Поклонники саги заметили: раз Гарри Поттер – сам по себе крестраж, он мог так же влиять и на семейство Дурслей. Это вполне может объяснять их отвратительное поведение.</p></li>
                    </ul>
                </div>
                <div className="projectItems">
                    <ul>
                        <li><h2 className="thingsTitle">Теория - 4</h2></li>
                        <li><h2 className="thingsTitle">Гарри, Снегг и Волан-де-Морт – три брата</h2></li>
                        <hr/>
                        <li><p className="projectDesc">В волшебном мире Гарри Поттера есть не только великие маги и нерадивые ученики, но и поэты-песенники! Так, бард Биддль записал сказку братьев Певерелл о трех братьях и дарах Смерти. Ее в последней книге читает Гермиона.

                            Трое братьев отправились путешествовать и вскоре остановились у реки. Они взмахнули палочками и соорудили над рекой мост. И на середине моста встретились со Смертью. Она была недовольна, что братья ее обхитрили, но притворилась, что восхищена их мастерством, и предложила им выбрать награду за то, что они ее перехитрили. Первый брат выбрал самую могущественную палочку в мире, второй – силу воскрешать умерших, а третий – такую вещь, чтобы Смерть не догнала его. Тогда Смерть отдала ему свою мантию-невидимку.

                            Первого брата убил злой волшебник после того, как проиграл в бою. И могущественную палочку с собой прихватил. Так Смерть забрала его. Второй брат воскресил свою любимую, на которой хотел жениться. Но она страдала в этом мире, и второй брат убил себя, лишь бы быть с ней в загробном мире. А третий брат пришел к Смерти сам, когда состарился. И ушли они в загробный мир со Смертью как равные.

                            И кажется нам, что эта сказка появилась в романе не только для того, чтобы рассказать о трех дарах смерти – палочке, мантии и камне. Поклонники уверены: это еще и отсылка к Гарри, Снеггу и Волан-де-Морту.

                            Первый брат – это Волан-де-Морт (он умер от жажды власти), второй брат – это Снегг (ради любви к Лили Поттер, матери Гарри, он все годы защищал его, работал на Дамблдора и умер, оставшись преданным светлой стороне), а третий брат – Гарри. Ну а Смерть – это профессор Дамблдор: он сам подарил Гарри плащ-невидимку, потом дал ему камень, а бузинной палочки он лишился только в поединке с Драко Малфоем. Роулинг, кстати, самой очень понравилась эта теория.</p></li>
                    </ul>
                </div>
                <div className="projectItems">
                    <ul>
                        <li><h2 className="thingsTitle">Теория - 5</h2></li>
                        <li><h2 className="thingsTitle">Гарри все выдумал</h2></li>
                        <hr/>
                        <li><p className="projectDesc">Что, если этих удивительных событий никогда не происходило? Что, если Гарри Поттер — это обычный мальчик, возможно, шизофреник, который жил в чулане под лестницей, и вся история происходила лишь в его голове? Это был его способ уйти от печальной реальности, в которой его брат, тетя и дядя каждый день издевались над ним.</p></li>
                    </ul>
                </div>
                <div className="projectItems">
                <ul>
                    <li><h2 className="thingsTitle">Теория - 6</h2></li>
                    <li><h2 className="thingsTitle">Невилл Долгопупс – настоящий избранный</h2></li>
                    <hr/>
                    <li><p className="projectDesc">Действительно ли Гарри Поттер – настоящий избранный? Пророчество гласит, что победить Темного Лорда сможет рожденный на исходе седьмого месяца, трижды бросавший ему вызов. Под это описание подходят и Гарри, и Невилл. Их семьи были членами Ордена Феникса и бросали вызов Волан-де-Морту. Почему тот решил, что именно Гарри – его погибель, непонятно. Но пришел Темный Лорд именно в дом Поттеров. Тут все и закрутилось.</p></li>
                </ul>
            </div>
                <div className="projectItems">
                    <ul>
                        <li><h2 className="thingsTitle">Теория - 7</h2></li>
                        <li><h2 className="thingsTitle">Кошка миссис Норис – на самом деле жена Филча?</h2></li>
                        <hr/>
                        <li><p className="projectDesc">Филч никуда не ходит без своей кошки. Но что если раньше эта пушистая подруга Филча была его женой? Поклонники поттерианы предполагают, что после несчастного случая миссис Филч навсегда осталась кошкой.</p></li>
                    </ul>
                </div>
                <div className="projectItems">
                    <ul>
                        <li><h2 className="thingsTitle">Теория - 8</h2></li>
                        <li><h2 className="thingsTitle">Гарри боится дементоров не просто так</h2></li>
                        <hr/>
                        <li><p className="projectDesc">Гарри боится дементоров больше остальных, они действуют на него сильнее, чем на окружающих. Вполне вероятно, дементоры предпочитают его больше прочих, потому что Гарри крестраж. Это значит, что у него внутри частица души Волдеморта, следовательно, он обладает 1,125 души, что и делает его "вкуснее" для дементоров.</p></li>
                    </ul>
                </div>
                <div className="projectItems">
                    <ul>
                        <li><h2 className="thingsTitle">Теория - 9</h2></li>
                        <li><h2 className="thingsTitle">Снейп на самом деле не умер</h2></li>
                        <hr/>
                        <li><p className="projectDesc">Северус Снейп был специалистом по зельеварению и "двойным агентом" много лет, поэтому вполне вероятно, что у него могло быть припасено противоядие на случай разоблачения. Кроме того, его тело не было найдено среди жертв Битвы за Хогвартс. И когда Гарри использовал Воскрешающий камень, его призрак не явился, в отличие от призраков его родителей, Сириуса Блэка и Римуса Люпина.

                            Именно поэтому Бузинная палочка не слушается Волдеморта — ему не удалось убить Снейпа. А не потому, что палочка сперва перешла к Драко Малфою, поскольку тот разоружил Дамблдора первым.

                            Возможно, Северус, выполнив свой долг перед Дамблдором и возлюбленной Лили, решил</p></li>
                    </ul>
                </div>
                <div className="projectItems">
                    <ul>
                        <li><h2 className="thingsTitle">Теория - 10</h2></li>
                        <li><h2 className="thingsTitle">Гарри бессмертен</h2></li>
                        <hr/>
                        <li><p className="projectDesc">"Один из них должен погибнуть от руки другого, ибо ни один не может жить спокойно, пока жив другой". Так звучит пророчество Сивиллы Трелони о связи Гарри Поттера и Волдеморта. Основная интерпретация заключается в том, что Гарри суждено убить злого волшебника или быть убитым им, третьего не дано. Но существует и другое объяснение пророчества, предложенное поклонниками истории. Если один из них должен умереть от руки другого, то выживший становится бессмертным, поскольку может быть убит лишь противником, оговоренным в предсказании Сивиллы. Таким образом, Гарри выполнил условия пророчества и, возможно, обрел бессмертие.</p></li>
                    </ul>
                </div>
            </div>
        </section>
    );
};

export default Things;